onvif_all/xml/RemoteDiscoveryBinding.Bye.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
 xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
 xmlns:dndl="http://www.onvif.org/ver10/network/wsdl/DiscoveryLookupBinding"
 xmlns:dnrd="http://www.onvif.org/ver10/network/wsdl/RemoteDiscoveryBinding"
 xmlns:d="http://schemas.xmlsoap.org/ws/2005/04/discovery"
 xmlns:dn="http://www.onvif.org/ver10/network/wsdl">
 <SOAP-ENV:Header>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <d:Bye>
    <wsa:EndpointReference>
     <Address></Address>
     <ReferenceProperties>
      <!-- extensibility element(s) -->

      <!-- extensibility element(s) -->

     </ReferenceProperties>
     <ReferenceParameters>
      <!-- extensibility element(s) -->

      <!-- extensibility element(s) -->

     </ReferenceParameters>
     <PortType></PortType>
     <ServiceName PortName=""></ServiceName>
     <!-- extensibility element(s) -->

     <!-- extensibility element(s) -->

    </wsa:EndpointReference>
    <Types></Types>
    <Scopes MatchBy=""></Scopes>
    <XAddrs></XAddrs>
    <MetadataVersion>0</MetadataVersion>
    <!-- extensibility element(s) -->

    <!-- extensibility element(s) -->

   </d:Bye>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
